Imports System.Math

Public Class Air
    Public Const g As Double = 9.80665 'ускорение силы тяжести м/сек.кв.
    Public Const Rg As Double = 29.27 'универсальная газовая постоянная кГм/кг*К
    Public Const conКельвин As Double = 273.16 ' 273.15 'абс. ноль

    Public Enum IzoentropaK
        K133
        K135
    End Enum

    Public Shared Function Kadiobaty(ByVal t As Double) As Double
        Return 1.4035 - 5.05 * (10 ^ -5) * t - 8.5 * (10 ^ -8) * t * t
    End Function

    ''' <summary>
    ''' парметры в Си и подсчет в Си
    ''' </summary>
    ''' <param name="N"></param>
    ''' <param name="tm"></param>
    ''' <returns></returns>
    Public Shared Function funПривестиN(ByVal N As Double, ByVal tm As Double) As Double
        Return N * Sqrt(288.15 / tm)
    End Function

    ''' <summary>
    ''' Приведённая скорость газового потока на входе в К.С.
    ''' В программе не используется
    ''' </summary>
    ''' <param name="ТемпВходС"></param>
    ''' <param name="ТемпТорможения309"></param>
    ''' <param name="РасходВоздуха"></param>
    ''' <param name="Fdif"></param>
    ''' <param name="Рст_абс_ср"></param>
    ''' <param name="Рв_вх_абс_полн_ср"></param>
    ''' <returns></returns>
    Public Shared Function LamdaFun(ByVal ТемпВходС As Double, ByVal ТемпТорможения309 As Double, ByVal РасходВоздуха As Double, ByVal Fdif As Double, ByVal Рст_абс_ср As Double, ByVal Рв_вх_абс_полн_ср As Double) As Double
        Dim LamdaTemp As Double
        Dim k As Double

        'Показатель адиабаты
        If (ТемпВходС) < 50 Then
            k = 1.4
        Else
            k = Kadiobaty(ТемпВходС)
        End If
        LamdaTemp = Math.Sqrt(((k + 1) / (2 * k)) * Rg * (ТемпТорможения309 + conКельвин)) * РасходВоздуха
        LamdaTemp /= (Рст_абс_ср * Fdif * 10000) 'проверить 10000 для подсчета в см.кв.
        LamdaTemp *= (Рст_абс_ср / Рв_вх_абс_полн_ср) ^ ((k - 1) / k)

        'проверка
        'Lamda_пров = Math.Sqrt((1 - (Рст_абс_ср / Рв_вх_абс_полн_ср) ^ ((k - 1) / k)) * ((k + 1) / (k - 1)))
        Return LamdaTemp
    End Function

    ''' <summary>
    ''' по g(a) определяется лямда
    ''' </summary>
    ''' <param name="a"></param>
    ''' <returns></returns>
    Public Function ПриведеннаяСкорость(ByVal a As Double, K As IzoentropaK) As Double
        'Dim N As Integer = 122
        Select Case K
            Case IzoentropaK.K135
                Return Spline3.Аппроксимация(UBound(Gla), Gla, La, KofЛямда135, a)
            Case Else
                Return Spline3.Аппроксимация(UBound(Gl), Gl, L, KofЛямда, a)
        End Select
    End Function

    Public Shared Function НеравномерностьFun(ByVal Tпояса As Double, ByVal T309 As Double, ByVal Tгаза As Double) As Double
        Return (Tпояса - T309) / (Tгаза - T309)
    End Function

    Public Shared Function КачествоFun(ByVal Tинтегр As Double, ByVal T309 As Double, ByVal Tгаза As Double) As Double
        Return (Tинтегр - T309) / (Tгаза - T309)
    End Function


    Private Табс2(171), Az(171), Kof3(171) As Double
    Private Лямда(33), Разность(33), Kof2(33) As Double
    Private Табс(123), Ig(123), Kof1(123), Kof4(123) As Double
    Private TblКоэффициентыПлотностиТоплива As Double(,)

    Private Gl(101), L(101), KofЛямда(101) As Double 'значения коэффициентов сплайн-аппроксимации для лямда при K=1.33
    Private Gla(75), La(75), KofЛямда135(75) As Double 'значения коэффициентов сплайн-аппроксимации для лямда при K=1.35

    Public Sub ИнициализацияПеременных()
        'Dim N As Integer 'количество точек по оси X

        'найдем таблицу коэффициентов 
        Dim Tt(11), P(11) As Double
        Tt(0) = -20 : P(0) = 0.81
        Tt(1) = -10 : P(1) = 0.8035
        Tt(2) = 0 : P(2) = 0.7947
        Tt(3) = 20 : P(3) = 0.7796
        Tt(4) = 40 : P(4) = 0.765
        Tt(5) = 60 : P(5) = 0.7498
        Tt(6) = 80 : P(6) = 0.7342
        Tt(7) = 100 : P(7) = 0.7212
        Tt(8) = 120 : P(8) = 0.7072
        Tt(9) = 150 : P(9) = 0.6832
        Tt(10) = 175 : P(10) = 0.6657
        Tt(11) = 200 : P(11) = 0.6482
        Spline3.Spline3BuildTable(UBound(Tt) + 1, 2, Tt, P, 0, 0, TblКоэффициентыПлотностиТоплива)

        '*****************************************
        'Dim I As Integer
        'Таблица из приложения №2(или №3 методики 20М-40) Табс->Ig
        Табс(1) = conКельвин : Ig(1) = 65.27
        Табс(2) = 280.0# : Ig(2) = 66.91
        Табс(3) = 288.16 : Ig(3) = 68.98
        Табс(4) = 290 : Ig(4) = 69.31
        Табс(5) = 298.16 : Ig(5) = 71.21
        Табс(6) = 300 : Ig(6) = 71.71
        Табс(7) = 310 : Ig(7) = 74.11
        Табс(8) = 320 : Ig(8) = 76.57
        Табс(9) = 330 : Ig(9) = 78.92
        Табс(10) = 340 : Ig(10) = 81.33
        Табс(11) = 350 : Ig(11) = 83.72
        Табс(12) = 360 : Ig(12) = 86.13
        Табс(13) = 370 : Ig(13) = 88.54
        Табс(14) = 380 : Ig(14) = 90.95
        Табс(15) = 390 : Ig(15) = 93.37
        Табс(16) = 400 : Ig(16) = 95.79
        Табс(17) = 410 : Ig(17) = 98.2
        Табс(18) = 420 : Ig(18) = 100.63
        Табс(19) = 430 : Ig(19) = 103.01
        Табс(20) = 440 : Ig(20) = 105.48
        Табс(21) = 450 : Ig(21) = 107.93
        Табс(22) = 460 : Ig(22) = 110.37
        Табс(23) = 470 : Ig(23) = 112.81
        Табс(24) = 480 : Ig(24) = 115.27
        Табс(25) = 490 : Ig(25) = 117.72
        Табс(26) = 500 : Ig(26) = 120.18
        Табс(27) = 510 : Ig(27) = 122.64
        Табс(28) = 520 : Ig(28) = 125.1
        Табс(29) = 530 : Ig(29) = 127.57
        Табс(30) = 540 : Ig(30) = 130.05
        Табс(31) = 550 : Ig(31) = 132.53
        Табс(32) = 560 : Ig(32) = 135.02
        Табс(33) = 570 : Ig(33) = 137.5
        Табс(34) = 580 : Ig(34) = 140.01
        Табс(35) = 590 : Ig(35) = 142.5
        Табс(36) = 600 : Ig(36) = 145.0#
        Табс(37) = 610 : Ig(37) = 147.52
        Табс(38) = 620 : Ig(38) = 150.04
        Табс(39) = 630 : Ig(39) = 152.57
        Табс(40) = 640 : Ig(40) = 155.09
        Табс(41) = 650 : Ig(41) = 157.63
        Табс(42) = 660 : Ig(42) = 160.17
        Табс(43) = 670 : Ig(43) = 162.72
        Табс(44) = 680 : Ig(44) = 165.28
        Табс(45) = 690 : Ig(45) = 167.84
        Табс(46) = 700 : Ig(46) = 170.4
        Табс(47) = 710 : Ig(47) = 172.98
        Табс(48) = 720 : Ig(48) = 175.56
        Табс(49) = 730 : Ig(49) = 178.15
        Табс(50) = 740 : Ig(50) = 180.74
        Табс(51) = 750 : Ig(51) = 183.35
        Табс(52) = 760 : Ig(52) = 185.93
        Табс(53) = 770 : Ig(53) = 188.54
        Табс(54) = 780 : Ig(54) = 191.15
        Табс(55) = 790 : Ig(55) = 193.76
        Табс(56) = 800 : Ig(56) = 196.38
        Табс(57) = 810 : Ig(57) = 199.01
        Табс(58) = 820 : Ig(58) = 201.63
        Табс(59) = 830 : Ig(59) = 204.26
        Табс(60) = 840 : Ig(60) = 206.9
        Табс(61) = 850 : Ig(61) = 209.53
        Табс(62) = 860 : Ig(62) = 212.19
        Табс(63) = 870 : Ig(63) = 214.84
        Табс(64) = 880 : Ig(64) = 217.5
        Табс(65) = 890 : Ig(65) = 220.17
        Табс(66) = 900 : Ig(66) = 222.84
        Табс(67) = 910 : Ig(67) = 225.51
        Табс(68) = 920 : Ig(68) = 228.19
        Табс(69) = 930 : Ig(69) = 230.87
        Табс(70) = 940 : Ig(70) = 233.56
        Табс(71) = 950 : Ig(71) = 236.25
        Табс(72) = 960 : Ig(72) = 238.95
        Табс(73) = 970 : Ig(73) = 241.65
        Табс(74) = 980 : Ig(74) = 244.37
        Табс(75) = 990 : Ig(75) = 247.08
        Табс(76) = 1000 : Ig(76) = 249.18
        Табс(77) = 1010 : Ig(77) = 252.53
        Табс(78) = 1020 : Ig(78) = 255.26
        Табс(79) = 1030 : Ig(79) = 258.0#
        Табс(80) = 1040 : Ig(80) = 260.74
        Табс(81) = 1050 : Ig(81) = 263.49
        Табс(82) = 1060 : Ig(82) = 266.24
        Табс(83) = 1070 : Ig(83) = 269.0#
        Табс(84) = 1080 : Ig(84) = 271.77
        Табс(85) = 1090 : Ig(85) = 274.54
        Табс(86) = 1100 : Ig(86) = 277.31
        Табс(87) = 1110 : Ig(87) = 280.09
        Табс(88) = 1120 : Ig(88) = 282.87
        Табс(89) = 1130 : Ig(89) = 285.66
        Табс(90) = 1140 : Ig(90) = 288.45
        Табс(91) = 1150 : Ig(91) = 291.25
        Табс(92) = 1160 : Ig(92) = 294.04
        Табс(93) = 1170 : Ig(93) = 295.84
        Табс(94) = 1180 : Ig(94) = 299.65
        Табс(95) = 1190 : Ig(95) = 302.46
        Табс(96) = 1200 : Ig(96) = 305.27
        Табс(97) = 1210 : Ig(97) = 308.06
        Табс(98) = 1220 : Ig(98) = 310.85
        Табс(99) = 1230 : Ig(99) = 313.65
        Табс(100) = 1240 : Ig(100) = 316.45
        Табс(101) = 1250 : Ig(101) = 319.25
        Табс(102) = 1260 : Ig(102) = 322.07
        Табс(103) = 1270 : Ig(103) = 324.89
        Табс(104) = 1280 : Ig(104) = 327.72
        Табс(105) = 1290 : Ig(105) = 330.55
        Табс(106) = 1300 : Ig(106) = 333.39
        Табс(107) = 1310 : Ig(107) = 336.23
        Табс(108) = 1320 : Ig(108) = 339.07
        Табс(109) = 1330 : Ig(109) = 341.92
        Табс(110) = 1340 : Ig(110) = 344.78
        Табс(111) = 1350 : Ig(111) = 347.64
        Табс(112) = 1360 : Ig(112) = 350.49
        Табс(113) = 1370 : Ig(113) = 353.34
        Табс(114) = 1380 : Ig(114) = 356.2
        Табс(115) = 1390 : Ig(115) = 359.06
        Табс(116) = 1400 : Ig(116) = 361.93
        Табс(117) = 1410 : Ig(117) = 364.78
        Табс(118) = 1420 : Ig(118) = 367.64
        Табс(119) = 1430 : Ig(119) = 370.51
        Табс(120) = 1440 : Ig(120) = 373.37
        Табс(121) = 1450 : Ig(121) = 376.25
        Табс(122) = 1460 : Ig(122) = 379.09
        Табс(123) = 1470 : Ig(123) = 381.94
        'Расчёт коэффициентов для таблицы
        'N = 123
        'ReDim_XX(N)
        'ReDim_YY(N)
        'ReDim_M(N)
        ''перезапись в глобальный массив
        'For I = 1 To N
        '    XX(I) = Табс(I)
        '    YY(I) = Ig(I)
        'Next I
        'ВводАппроксимация(N, XX, YY, M)
        ''сохранение коэффициентов энтальпии
        'For I = LBound(M) To UBound(M)
        '    Kof1(I) = M(I)
        'Next I
        Spline3.ВводАппроксимация(UBound(Табс), Табс, Ig, Kof1)


        '*****************************************
        'Таблица из приложения №2 Ig->Табс
        'Расчёт коэффициентов для таблицы
        'N = 123
        'ReDim_XX(N)
        'ReDim_YY(N)
        'ReDim_M(N)
        ''перезапись в глобальный массив
        'For I = 1 To N
        '    XX(I) = Ig(I)
        '    YY(I) = Табс(I)
        'Next I
        'ВводАппроксимация(N, XX, YY, M)
        ''сохранение коэффициентов энтальпии
        'For I = LBound(M) To UBound(M)
        '    Kof4(I) = M(I)
        'Next I
        Spline3.ВводАппроксимация(UBound(Ig), Ig, Табс, Kof4)


        '*****************************************
        'Таблица из приложения №3 Лямда->Разность (график)
        Лямда(1) = 1.8 : Разность(1) = 1240
        Лямда(2) = 2.0# : Разность(2) = 1126
        Лямда(3) = 2.1 : Разность(3) = 1080
        Лямда(4) = 2.2 : Разность(4) = 1040
        Лямда(5) = 2.3 : Разность(5) = 1000
        Лямда(6) = 2.4 : Разность(6) = 964
        Лямда(7) = 2.5 : Разность(7) = 928
        Лямда(8) = 2.6 : Разность(8) = 900
        Лямда(9) = 2.7 : Разность(9) = 872
        Лямда(10) = 2.8 : Разность(10) = 848
        Лямда(11) = 2.9 : Разность(11) = 824
        Лямда(12) = 3.0# : Разность(12) = 800
        Лямда(13) = 3.1 : Разность(13) = 780
        Лямда(14) = 3.2 : Разность(14) = 758
        Лямда(15) = 3.3 : Разность(15) = 738
        Лямда(16) = 3.4 : Разность(16) = 718
        Лямда(17) = 3.5 : Разность(17) = 700
        Лямда(18) = 3.6 : Разность(18) = 680
        Лямда(19) = 3.7 : Разность(19) = 664
        Лямда(20) = 3.8 : Разность(20) = 648
        Лямда(21) = 3.9 : Разность(21) = 632
        Лямда(22) = 4.0# : Разность(22) = 618
        Лямда(23) = 4.1 : Разность(23) = 604
        Лямда(24) = 4.2 : Разность(24) = 590
        Лямда(25) = 4.3 : Разность(25) = 578
        Лямда(26) = 4.4 : Разность(26) = 566
        Лямда(27) = 4.5 : Разность(27) = 555
        Лямда(28) = 4.6 : Разность(28) = 542
        Лямда(29) = 4.7 : Разность(29) = 532
        Лямда(30) = 4.8 : Разность(30) = 520
        Лямда(31) = 4.9 : Разность(31) = 510
        Лямда(32) = 5.0# : Разность(32) = 502
        Лямда(33) = 5.1 : Разность(33) = 494
        'N = 33
        'ReDim_XX(N)
        'ReDim_YY(N)
        'ReDim_M(N)
        ''перезапись в глобальный массив
        'For I = 1 To N
        '    XX(I) = Лямда(I)
        '    YY(I) = Разность(I)
        'Next I
        'ВводАппроксимация(N, XX, YY, M)
        ''сохранение коэффициентов прикидки температуры
        'For I = LBound(M) To UBound(M)
        '    Kof2(I) = M(I)
        'Next I
        Spline3.ВводАппроксимация(UBound(Лямда), Лямда, Разность, Kof2)

        '*****************************************
        'Таблица из приложения №4 Табс2->Az
        Табс2(1) = conКельвин : Az(1) = 10205.73
        Табс2(2) = 280 : Az(3) = 10202.57
        Табс2(3) = 288.16 : Az(3) = 10198.79
        Табс2(4) = 290 : Az(4) = 10197.93
        Табс2(5) = 298.16 : Az(5) = 10194.19
        Табс2(6) = 300 : Az(6) = 10191.51
        Табс2(7) = 310 : Az(7) = 10188.61
        Табс2(8) = 320 : Az(8) = 10183.76
        Табс2(9) = 330 : Az(9) = 10178.8
        Табс2(10) = 340 : Az(10) = 10174.01
        Табс2(11) = 350 : Az(11) = 10169.05
        Табс2(12) = 360 : Az(12) = 10164.03
        Табс2(13) = 370 : Az(13) = 10159.89
        Табс2(14) = 380 : Az(14) = 10153.79
        Табс2(15) = 390 : Az(15) = 10148.54
        Табс2(16) = 400 : Az(16) = 10143.29
        Табс2(17) = 410 : Az(17) = 10137.92
        Табс2(18) = 420 : Az(18) = 10133.48
        Табс2(19) = 430 : Az(19) = 10127.05
        Табс2(20) = 440 : Az(20) = 10121.52
        Табс2(21) = 450 : Az(21) = 10115.99
        Табс2(22) = 460 : Az(22) = 10110.36
        Табс2(23) = 470 : Az(23) = 10104.74
        Табс2(24) = 480 : Az(24) = 10099.07
        Табс2(25) = 490 : Az(25) = 10093.38
        Табс2(26) = 500 : Az(26) = 10087.52
        Табс2(27) = 510 : Az(27) = 10081.83
        Табс2(28) = 520 : Az(28) = 10076.02
        Табс2(29) = 530 : Az(29) = 10070.11
        Табс2(30) = 540 : Az(30) = 10064.18
        Табс2(31) = 550 : Az(31) = 10058.23
        Табс2(32) = 560 : Az(32) = 10052.23
        Табс2(33) = 570 : Az(33) = 10045.19
        Табс2(34) = 580 : Az(34) = 10040.1
        Табс2(35) = 590 : Az(35) = 10034.02
        Табс2(36) = 600 : Az(36) = 10027.84
        Табс2(37) = 610 : Az(37) = 10021.67
        Табс2(38) = 620 : Az(38) = 10015.44
        Табс2(39) = 630 : Az(39) = 10009.16
        Табс2(40) = 640 : Az(40) = 10002.83
        Табс2(41) = 650 : Az(41) = 9996.44
        Табс2(42) = 660 : Az(42) = 9990.05
        Табс2(43) = 670 : Az(43) = 9983.61
        Табс2(44) = 680 : Az(44) = 9977.12
        Табс2(45) = 690 : Az(45) = 9970.58
        Табс2(46) = 700 : Az(46) = 9963.98
        Табс2(47) = 710 : Az(47) = 9957.43
        Табс2(48) = 720 : Az(48) = 9950.83
        Табс2(49) = 730 : Az(49) = 9944.18
        Табс2(50) = 740 : Az(50) = 9937.48
        Табс2(51) = 750 : Az(51) = 9930.74
        Табс2(52) = 760 : Az(52) = 9924.07
        Табс2(53) = 770 : Az(53) = 9917.35
        Табс2(54) = 780 : Az(54) = 9910.58
        Табс2(55) = 790 : Az(55) = 9903.78
        Табс2(56) = 800 : Az(56) = 9896.92
        Табс2(57) = 810 : Az(57) = 9890.08
        Табс2(58) = 820 : Az(58) = 9883.19
        Табс2(59) = 830 : Az(59) = 9875.26
        Табс2(60) = 840 : Az(60) = 9869.48
        Табс2(61) = 850 : Az(61) = 9862.26
        Табс2(62) = 860 : Az(62) = 9855.21
        Табс2(63) = 870 : Az(63) = 9848.11
        Табс2(64) = 880 : Az(64) = 9840.97
        Табс2(65) = 890 : Az(65) = 9833.79
        Табс2(66) = 900 : Az(66) = 9826.56
        Табс2(67) = 910 : Az(67) = 9819.32
        Табс2(68) = 920 : Az(68) = 9812.03
        Табс2(69) = 930 : Az(69) = 9804.7
        Табс2(70) = 940 : Az(70) = 9797.33
        Табс2(71) = 950 : Az(71) = 9789.92
        Табс2(72) = 960 : Az(72) = 9782.52
        Табс2(73) = 970 : Az(73) = 9775.08
        Табс2(74) = 980 : Az(74) = 9767.6
        Табс2(75) = 990 : Az(75) = 9760.07
        Табс2(76) = 1000 : Az(76) = 9752.51
        Табс2(77) = 1010 : Az(77) = 9744.98
        Табс2(78) = 1020 : Az(78) = 9737.42
        Табс2(79) = 1030 : Az(79) = 9729.82
        Табс2(80) = 1040 : Az(80) = 9722.18
        Табс2(81) = 1050 : Az(81) = 9714.5
        Табс2(82) = 1060 : Az(82) = 9706.84
        Табс2(83) = 1070 : Az(83) = 9699.14
        Табс2(84) = 1080 : Az(84) = 9691.4
        Табс2(85) = 1090 : Az(85) = 9683.62
        Табс2(86) = 1100 : Az(86) = 9675.81
        Табс2(87) = 1110 : Az(87) = 9668.03
        Табс2(88) = 1120 : Az(88) = 9660.21
        Табс2(89) = 1130 : Az(89) = 9652.36
        Табс2(90) = 1140 : Az(90) = 9644.47
        Табс2(91) = 1150 : Az(91) = 9636.54
        Табс2(92) = 1160 : Az(92) = 9828.55
        Табс2(93) = 1170 : Az(93) = 9620.53
        Табс2(94) = 1180 : Az(94) = 9612.46
        Табс2(95) = 1190 : Az(95) = 9604.36
        Табс2(96) = 1200 : Az(96) = 9596.23
        Табс2(97) = 1210 : Az(97) = 9588.09
        Табс2(98) = 1220 : Az(98) = 9579.91
        Табс2(99) = 1230 : Az(99) = 9571.69
        Табс2(100) = 1240 : Az(100) = 9563.44
        Табс2(101) = 1250 : Az(101) = 9555.15
        Табс2(102) = 1260 : Az(102) = 9546.89
        Табс2(103) = 1270 : Az(103) = 9538.6
        Табс2(104) = 1280 : Az(104) = 9530.27
        Табс2(105) = 1290 : Az(105) = 9521.9
        Табс2(106) = 1300 : Az(106) = 9513.5
        Табс2(107) = 1310 : Az(107) = 9505.13
        Табс2(108) = 1320 : Az(108) = 9496.72
        Табс2(109) = 1330 : Az(109) = 9488.27
        Табс2(110) = 1340 : Az(110) = 9479.79
        Табс2(111) = 1350 : Az(111) = 9471.28
        Табс2(112) = 1360 : Az(112) = 9462.77
        Табс2(113) = 1370 : Az(113) = 9454.23
        Табс2(114) = 1380 : Az(114) = 9445.66
        Табс2(115) = 1390 : Az(115) = 9437.05
        Табс2(116) = 1400 : Az(116) = 9428.41
        Табс2(117) = 1410 : Az(117) = 9419.78
        Табс2(118) = 1420 : Az(118) = 9411.11
        Табс2(119) = 1430 : Az(119) = 9402.41
        Табс2(120) = 1440 : Az(120) = 9393.68
        Табс2(121) = 1450 : Az(121) = 9384.91
        Табс2(122) = 1460 : Az(122) = 9376.17
        Табс2(123) = 1470 : Az(123) = 9367.4
        Табс2(124) = 1480 : Az(124) = 9358.6
        Табс2(125) = 1490 : Az(125) = 9349.76
        Табс2(126) = 1500 : Az(126) = 9340.9
        Табс2(127) = 1510 : Az(127) = 9332.11
        Табс2(128) = 1520 : Az(128) = 9323.3
        Табс2(129) = 1530 : Az(129) = 9314.45
        Табс2(130) = 1540 : Az(130) = 9305.57
        Табс2(131) = 1550 : Az(131) = 9296.66
        Табс2(132) = 1560 : Az(132) = 9287.77
        Табс2(133) = 1570 : Az(133) = 9278.84
        Табс2(134) = 1580 : Az(134) = 9269.88
        Табс2(135) = 1590 : Az(135) = 9260.9
        Табс2(136) = 1600 : Az(136) = 9251.88
        Табс2(137) = 1610 : Az(137) = 9242.87
        Табс2(138) = 1620 : Az(138) = 9233.83
        Табс2(139) = 1630 : Az(139) = 9224.76
        Табс2(140) = 1640 : Az(140) = 9215.66
        Табс2(141) = 1650 : Az(141) = 9206.53
        Табс2(142) = 1660 : Az(142) = 9197.4
        Табс2(143) = 1670 : Az(143) = 9188.24
        Табс2(144) = 1680 : Az(144) = 9179.04
        Табс2(145) = 1690 : Az(145) = 9169.82
        Табс2(146) = 1700 : Az(146) = 9160.57
        Табс2(147) = 1710 : Az(147) = 9151.41
        Табс2(148) = 1720 : Az(148) = 9142.23
        Табс2(149) = 1730 : Az(149) = 9133.01
        Табс2(150) = 1740 : Az(150) = 9123.77
        Табс2(151) = 1750 : Az(151) = 9114.5
        Табс2(152) = 1760 : Az(152) = 9105.29
        Табс2(153) = 1770 : Az(153) = 9096.06
        Табс2(154) = 1780 : Az(154) = 9086.8
        Табс2(155) = 1790 : Az(155) = 9077.51
        Табс2(156) = 1800 : Az(156) = 9068.2
        Табс2(157) = 1810 : Az(157) = 9058.92
        Табс2(158) = 1820 : Az(158) = 9049.6
        Табс2(159) = 1830 : Az(159) = 9040.27
        Табс2(160) = 1840 : Az(160) = 9030.9
        Табс2(161) = 1850 : Az(161) = 9021.51
        Табс2(162) = 1860 : Az(162) = 9012.17
        Табс2(163) = 1870 : Az(163) = 9002.81
        Табс2(164) = 1880 : Az(164) = 8993.42
        Табс2(165) = 1890 : Az(165) = 8984.0#
        Табс2(166) = 1900 : Az(166) = 8974.56
        Табс2(167) = 1910 : Az(167) = 8965.07
        Табс2(168) = 1920 : Az(168) = 8955.56
        Табс2(169) = 1930 : Az(169) = 8946.02
        Табс2(170) = 1940 : Az(170) = 8936.45
        Табс2(171) = 1950 : Az(171) = 8926.86
        'N = 171
        'ReDim_XX(N)
        'ReDim_YY(N)
        'ReDim_M(N)
        ''перезапись в глобальный массив
        'For I = 1 To N
        '    XX(I) = Табс2(I)
        '    YY(I) = Az(I)
        'Next I
        'ВводАппроксимация(N, XX, YY, M)
        ''сохранение коэффициентов Az
        'For I = LBound(M) To UBound(M)
        '    Kof3(I) = M(I)
        'Next I
        Spline3.ВводАппроксимация(UBound(Табс2), Табс2, Az, Kof3)

        'Основные газодинамические функции при k =1,33
        ' лямда от q(лямда)
        'Gl(1) = 0.0# : L(1) = 0.0#
        'Gl(2) = 0.0159 : L(2) = 0.01
        'Gl(3) = 0.0318 : L(3) = 0.02
        'Gl(4) = 0.0476 : L(4) = 0.03
        'Gl(5) = 0.0635 : L(5) = 0.04
        'Gl(6) = 0.0793 : L(6) = 0.05
        'Gl(7) = 0.0952 : L(7) = 0.06
        'Gl(8) = 0.111 : L(8) = 0.07
        'Gl(9) = 0.1267 : L(9) = 0.08
        'Gl(10) = 0.1425 : L(10) = 0.09
        'Gl(11) = 0.1582 : L(11) = 0.1
        'Gl(12) = 0.1738 : L(12) = 0.11
        'Gl(13) = 0.1894 : L(13) = 0.12
        'Gl(14) = 0.2052 : L(14) = 0.13
        'Gl(15) = 0.2205 : L(15) = 0.14
        'Gl(16) = 0.236 : L(16) = 0.15
        'Gl(17) = 0.2514 : L(17) = 0.16
        'Gl(18) = 0.2667 : L(18) = 0.17
        'Gl(19) = 0.282 : L(19) = 0.18
        'Gl(20) = 0.2972 : L(20) = 0.19
        'Gl(21) = 0.3123 : L(21) = 0.2
        'Gl(22) = 0.3273 : L(22) = 0.21
        'Gl(23) = 0.3423 : L(23) = 0.22
        'Gl(24) = 0.3571 : L(24) = 0.23
        'Gl(25) = 0.3719 : L(25) = 0.24
        'Gl(26) = 0.3866 : L(26) = 0.25
        'Gl(27) = 0.4011 : L(27) = 0.26
        'Gl(28) = 0.4155 : L(28) = 0.27
        'Gl(29) = 0.43 : L(29) = 0.28
        'Gl(30) = 0.4443 : L(30) = 0.29
        'Gl(31) = 0.4584 : L(31) = 0.3
        'Gl(32) = 0.4724 : L(32) = 0.31
        'Gl(33) = 0.4863 : L(33) = 0.32
        'Gl(34) = 0.5001 : L(34) = 0.33
        'Gl(35) = 0.5137 : L(35) = 0.34
        'Gl(36) = 0.5273 : L(36) = 0.35
        'Gl(37) = 0.5407 : L(37) = 0.36
        'Gl(38) = 0.5539 : L(38) = 0.37
        'Gl(39) = 0.567 : L(39) = 0.38
        'Gl(40) = 0.5799 : L(40) = 0.39
        'Gl(41) = 0.5928 : L(41) = 0.4
        'Gl(42) = 0.6055 : L(42) = 0.41
        'Gl(43) = 0.6179 : L(43) = 0.42
        'Gl(44) = 0.6303 : L(44) = 0.43
        'Gl(45) = 0.6425 : L(45) = 0.44
        'Gl(46) = 0.6545 : L(46) = 0.45
        'Gl(47) = 0.6666 : L(47) = 0.46
        'Gl(48) = 0.678 : L(48) = 0.47
        'Gl(49) = 0.6896 : L(49) = 0.48
        'Gl(50) = 0.7009 : L(50) = 0.49
        'Gl(51) = 0.7121 : L(51) = 0.5
        'Gl(52) = 0.723 : L(52) = 0.51
        'Gl(53) = 0.7339 : L(53) = 0.52
        'Gl(54) = 0.7445 : L(54) = 0.53
        'Gl(55) = 0.7548 : L(55) = 0.54
        'Gl(56) = 0.7651 : L(56) = 0.55
        'Gl(57) = 0.7752 : L(57) = 0.56
        'Gl(58) = 0.785 : L(58) = 0.57
        'Gl(59) = 0.7946 : L(59) = 0.58
        'Gl(60) = 0.804 : L(60) = 0.59
        'Gl(61) = 0.8133 : L(61) = 0.6
        'Gl(62) = 0.8224 : L(62) = 0.61
        'Gl(63) = 0.8312 : L(63) = 0.62
        'Gl(64) = 0.8399 : L(64) = 0.63
        'Gl(65) = 0.8483 : L(65) = 0.64
        'Gl(66) = 0.8564 : L(66) = 0.65
        'Gl(67) = 0.8645 : L(67) = 0.66
        'Gl(68) = 0.8722 : L(68) = 0.67
        'Gl(69) = 0.8798 : L(69) = 0.68
        'Gl(70) = 0.8871 : L(70) = 0.69
        'Gl(71) = 0.8941 : L(71) = 0.7
        'Gl(72) = 0.9011 : L(72) = 0.71
        'Gl(73) = 0.9077 : L(73) = 0.72
        'Gl(74) = 0.9143 : L(74) = 0.73
        'Gl(75) = 0.9204 : L(75) = 0.74
        'Gl(76) = 0.9265 : L(76) = 0.75
        'Gl(77) = 0.9322 : L(77) = 0.76
        'Gl(78) = 0.9377 : L(78) = 0.77
        'Gl(79) = 0.943 : L(79) = 0.78
        'Gl(80) = 0.9481 : L(80) = 0.79
        'Gl(81) = 0.9529 : L(81) = 0.8
        'Gl(82) = 0.9575 : L(82) = 0.81
        'Gl(83) = 0.9618 : L(83) = 0.82
        'Gl(84) = 0.966 : L(84) = 0.83
        'Gl(85) = 0.9698 : L(85) = 0.84
        'Gl(86) = 0.9735 : L(86) = 0.85
        'Gl(87) = 0.9769 : L(87) = 0.86
        'Gl(88) = 0.9802 : L(88) = 0.87
        'Gl(89) = 0.983 : L(89) = 0.88
        'Gl(90) = 0.9859 : L(90) = 0.89
        'Gl(91) = 0.9883 : L(91) = 0.9
        'Gl(92) = 0.9904 : L(92) = 0.91
        'Gl(93) = 0.9925 : L(93) = 0.92
        'Gl(94) = 0.9943 : L(94) = 0.93
        'Gl(95) = 0.9957 : L(95) = 0.94
        'Gl(96) = 0.9972 : L(96) = 0.95
        'Gl(97) = 0.9981 : L(97) = 0.96
        'Gl(98) = 0.9989 : L(98) = 0.97
        'Gl(99) = 0.9995 : L(99) = 0.98
        'Gl(100) = 1.0# : L(100) = 0.99

        L(1) = 0.00 : Gl(1) = 0.00000
        L(2) = 0.01 : Gl(2) = 0.01588
        L(3) = 0.02 : Gl(3) = 0.03176
        L(4) = 0.03 : Gl(4) = 0.04764
        L(5) = 0.04 : Gl(5) = 0.0635
        L(6) = 0.05 : Gl(6) = 0.07934
        L(7) = 0.06 : Gl(7) = 0.09516
        L(8) = 0.07 : Gl(8) = 0.11096
        L(9) = 0.08 : Gl(9) = 0.12673
        L(10) = 0.09 : Gl(10) = 0.14247
        L(11) = 0.1 : Gl(11) = 0.15817
        L(12) = 0.11 : Gl(12) = 0.17383
        L(13) = 0.12 : Gl(13) = 0.18944
        L(14) = 0.13 : Gl(14) = 0.20501
        L(15) = 0.14 : Gl(15) = 0.22052
        L(16) = 0.15 : Gl(16) = 0.23598
        L(17) = 0.16 : Gl(17) = 0.25138
        L(18) = 0.17 : Gl(18) = 0.26671
        L(19) = 0.18 : Gl(19) = 0.28197
        L(20) = 0.19 : Gl(20) = 0.29716
        L(21) = 0.2 : Gl(21) = 0.31228
        L(22) = 0.21 : Gl(22) = 0.32731
        L(23) = 0.22 : Gl(23) = 0.34226
        L(24) = 0.23 : Gl(24) = 0.35712
        L(25) = 0.24 : Gl(25) = 0.37189
        L(26) = 0.25 : Gl(26) = 0.38657
        L(27) = 0.26 : Gl(27) = 0.40114
        L(28) = 0.27 : Gl(28) = 0.41562
        L(29) = 0.28 : Gl(29) = 0.42998
        L(30) = 0.29 : Gl(30) = 0.44424
        L(31) = 0.3 : Gl(31) = 0.45838
        L(32) = 0.31 : Gl(32) = 0.4724
        L(33) = 0.32 : Gl(33) = 0.48631
        L(34) = 0.33 : Gl(34) = 0.50009
        L(35) = 0.34 : Gl(35) = 0.51374
        L(36) = 0.35 : Gl(36) = 0.52726
        L(37) = 0.36 : Gl(37) = 0.54064
        L(38) = 0.37 : Gl(38) = 0.55389
        L(39) = 0.38 : Gl(39) = 0.56699
        L(40) = 0.39 : Gl(40) = 0.57995
        L(41) = 0.4 : Gl(41) = 0.59276
        L(42) = 0.41 : Gl(42) = 0.60542
        L(43) = 0.42 : Gl(43) = 0.61793
        L(44) = 0.43 : Gl(44) = 0.63028
        L(45) = 0.44 : Gl(45) = 0.64247
        L(46) = 0.45 : Gl(46) = 0.65449
        L(47) = 0.46 : Gl(47) = 0.66635
        L(48) = 0.47 : Gl(48) = 0.67804
        L(49) = 0.48 : Gl(49) = 0.68955
        L(50) = 0.49 : Gl(50) = 0.70089
        L(51) = 0.5 : Gl(51) = 0.71206
        L(52) = 0.51 : Gl(52) = 0.72304
        L(53) = 0.52 : Gl(53) = 0.73384
        L(54) = 0.53 : Gl(54) = 0.74445
        L(55) = 0.54 : Gl(55) = 0.75488
        L(56) = 0.55 : Gl(56) = 0.76511
        L(57) = 0.56 : Gl(57) = 0.77515
        L(58) = 0.57 : Gl(58) = 0.78499
        L(59) = 0.58 : Gl(59) = 0.79464
        L(60) = 0.59 : Gl(60) = 0.80409
        L(61) = 0.6 : Gl(61) = 0.81333
        L(62) = 0.61 : Gl(62) = 0.82237
        L(63) = 0.62 : Gl(63) = 0.8312
        L(64) = 0.63 : Gl(64) = 0.83982
        L(65) = 0.64 : Gl(65) = 0.84824
        L(66) = 0.65 : Gl(66) = 0.85644
        L(67) = 0.66 : Gl(67) = 0.86442
        L(68) = 0.67 : Gl(68) = 0.87219
        L(69) = 0.68 : Gl(69) = 0.87975
        L(70) = 0.69 : Gl(70) = 0.88708
        L(71) = 0.7 : Gl(71) = 0.89419
        L(72) = 0.71 : Gl(72) = 0.90108
        L(73) = 0.72 : Gl(73) = 0.90774
        L(74) = 0.73 : Gl(74) = 0.91418
        L(75) = 0.74 : Gl(75) = 0.9204
        L(76) = 0.75 : Gl(76) = 0.92638
        L(77) = 0.76 : Gl(77) = 0.93214
        L(78) = 0.77 : Gl(78) = 0.93767
        L(79) = 0.78 : Gl(79) = 0.94296
        L(80) = 0.79 : Gl(80) = 0.94803
        L(81) = 0.8 : Gl(81) = 0.95286
        L(82) = 0.81 : Gl(82) = 0.95746
        L(83) = 0.82 : Gl(83) = 0.96182
        L(84) = 0.83 : Gl(84) = 0.96595
        L(85) = 0.84 : Gl(85) = 0.96985
        L(86) = 0.85 : Gl(86) = 0.97351
        L(87) = 0.86 : Gl(87) = 0.97693
        L(88) = 0.87 : Gl(88) = 0.98011
        L(89) = 0.88 : Gl(89) = 0.98306
        L(90) = 0.89 : Gl(90) = 0.98578
        L(91) = 0.9 : Gl(91) = 0.98825
        L(92) = 0.91 : Gl(92) = 0.99049
        L(93) = 0.92 : Gl(93) = 0.99249
        L(94) = 0.93 : Gl(94) = 0.99425
        L(95) = 0.94 : Gl(95) = 0.99578
        L(96) = 0.95 : Gl(96) = 0.99707
        L(97) = 0.96 : Gl(97) = 0.99813
        L(98) = 0.97 : Gl(98) = 0.99895
        L(99) = 0.98 : Gl(99) = 0.99953
        L(100) = 0.99 : Gl(100) = 0.99988
        L(101) = 1.0 : Gl(101) = 1.0
        'L(102) = 1.01 : Gl(102) = 0.99988
        'L(103) = 1.02 : Gl(103) = 0.99954
        'L(104) = 1.03 : Gl(104) = 0.99896
        'L(105) = 1.04 : Gl(105) = 0.99815
        'L(106) = 1.05 : Gl(106) = 0.99711
        'L(107) = 1.06 : Gl(107) = 0.99584
        'L(108) = 1.07 : Gl(108) = 0.99434
        'L(109) = 1.08 : Gl(109) = 0.99262
        'L(110) = 1.09 : Gl(110) = 0.99068
        'L(111) = 1.1 : Gl(111) = 0.98851
        'L(112) = 1.11 : Gl(112) = 0.98613
        'L(113) = 1.12 : Gl(113) = 0.98352
        'L(114) = 1.13 : Gl(114) = 0.98069
        'L(115) = 1.14 : Gl(115) = 0.97765
        'L(116) = 1.15 : Gl(116) = 0.9744
        'L(117) = 1.16 : Gl(117) = 0.97093
        'L(118) = 1.17 : Gl(118) = 0.96725
        'L(119) = 1.18 : Gl(119) = 0.96336
        'L(120) = 1.19 : Gl(120) = 0.95927
        'L(121) = 1.2 : Gl(121) = 0.95497
        'L(122) = 1.21 : Gl(122) = 0.95047
        ''Gl - это Х и должно только возрастать
        Spline3.ВводАппроксимация(UBound(Gl), Gl, L, KofЛямда)

        'Основные газодинамические функции при k =1,35
        ' лямда от q(лямда)
        La(1) = 0.01 : Gla(1) = 0.01585
        La(2) = 0.02 : Gla(2) = 0.0317
        La(3) = 0.03 : Gla(3) = 0.04754
        La(4) = 0.04 : Gla(4) = 0.06337
        La(5) = 0.05 : Gla(5) = 0.07918
        La(6) = 0.06 : Gla(6) = 0.09497
        La(7) = 0.07 : Gla(7) = 0.11074
        La(8) = 0.08 : Gla(8) = 0.12648
        La(9) = 0.09 : Gla(9) = 0.14218
        La(10) = 0.1 : Gla(10) = 0.15786
        La(11) = 0.11 : Gla(11) = 0.17349
        La(12) = 0.12 : Gla(12) = 0.18907
        La(13) = 0.13 : Gla(13) = 0.20461
        La(14) = 0.14 : Gla(14) = 0.22009
        La(15) = 0.15 : Gla(15) = 0.23552
        La(16) = 0.16 : Gla(16) = 0.25089
        La(17) = 0.17 : Gla(17) = 0.2662
        La(18) = 0.18 : Gla(18) = 0.28144
        La(19) = 0.19 : Gla(19) = 0.2966
        La(20) = 0.2 : Gla(20) = 0.31169
        La(21) = 0.21 : Gla(21) = 0.3267
        La(22) = 0.22 : Gla(22) = 0.34163
        La(23) = 0.23 : Gla(23) = 0.35647
        La(24) = 0.24 : Gla(24) = 0.37122
        La(25) = 0.25 : Gla(25) = 0.38587
        La(26) = 0.26 : Gla(26) = 0.40043
        La(27) = 0.27 : Gla(27) = 0.41488
        La(28) = 0.28 : Gla(28) = 0.42923
        La(29) = 0.29 : Gla(29) = 0.44347
        La(30) = 0.3 : Gla(30) = 0.4576
        La(31) = 0.31 : Gla(31) = 0.47161
        La(32) = 0.32 : Gla(32) = 0.4855
        La(33) = 0.33 : Gla(33) = 0.49927
        La(34) = 0.34 : Gla(34) = 0.51291
        La(35) = 0.35 : Gla(35) = 0.52642
        La(36) = 0.36 : Gla(36) = 0.53979
        La(37) = 0.37 : Gla(37) = 0.55303
        La(38) = 0.38 : Gla(38) = 0.56613
        La(39) = 0.39 : Gla(39) = 0.57908
        La(40) = 0.4 : Gla(40) = 0.59189
        La(41) = 0.41 : Gla(41) = 0.60455
        La(42) = 0.42 : Gla(42) = 0.61705
        La(43) = 0.43 : Gla(43) = 0.6294
        La(44) = 0.44 : Gla(44) = 0.64159
        La(45) = 0.45 : Gla(45) = 0.65361
        La(46) = 0.46 : Gla(46) = 0.66547
        La(47) = 0.47 : Gla(47) = 0.67717
        La(48) = 0.48 : Gla(48) = 0.68869
        La(49) = 0.49 : Gla(49) = 0.70003
        La(50) = 0.5 : Gla(50) = 0.7112
        La(51) = 0.51 : Gla(51) = 0.7222
        La(52) = 0.52 : Gla(52) = 0.733
        La(53) = 0.53 : Gla(53) = 0.74363
        La(54) = 0.54 : Gla(54) = 0.75406
        La(55) = 0.55 : Gla(55) = 0.76431
        La(56) = 0.56 : Gla(56) = 0.77436
        La(57) = 0.57 : Gla(57) = 0.78422
        La(58) = 0.58 : Gla(58) = 0.79388
        La(59) = 0.59 : Gla(59) = 0.80334
        La(60) = 0.6 : Gla(60) = 0.8126
        La(61) = 0.61 : Gla(61) = 0.82166
        La(62) = 0.62 : Gla(62) = 0.83051
        La(63) = 0.63 : Gla(63) = 0.83915
        La(64) = 0.64 : Gla(64) = 0.84759
        La(65) = 0.65 : Gla(65) = 0.85581
        La(66) = 0.66 : Gla(66) = 0.86381
        La(67) = 0.67 : Gla(67) = 0.87161
        La(68) = 0.68 : Gla(68) = 0.87918
        La(69) = 0.69 : Gla(69) = 0.88653
        La(70) = 0.7 : Gla(70) = 0.89367
        La(71) = 0.71 : Gla(71) = 0.90058
        La(72) = 0.72 : Gla(72) = 0.90727
        La(73) = 0.73 : Gla(73) = 0.91373
        La(74) = 0.74 : Gla(74) = 0.91997
        La(75) = 0.75 : Gla(75) = 0.92598

        Spline3.ВводАппроксимация(UBound(Gla), Gla, La, KofЛямда135)
    End Sub

    ''' <summary>
    ''' процедура находит расчётную температуру газового потока за камерой сгорания
    ''' </summary>
    ''' <param name="T3"></param>
    ''' <param name="Gtks"></param>
    ''' <param name="Gbks"></param>
    ''' <param name="АльфаСум"></param>
    ''' <returns></returns>
    Public Function РасчётнаяТемпература(ByVal T3 As Double, ByVal Gtks As Double, ByVal Gbks As Double, ByVal АльфаСум As Double) As Double
        'входные переменные Т3-температура на входном мерном участке в Кельвин, Gtks-расход топлива суммарный (Gтопл суммарный)в час
        'Gbks-расход воздуха камеры (Gвозд кс)сгорания в секунду, АльфаСум-суммарный коэф. избытка воздуха, Tgras-выходная величина в Цельсий
        'Dim I As Integer
        Dim Tgras As Double
        Dim a As Double, B As Double
        Dim C As Double, Ik As Double, W As Double
        'Dim N As Integer
        '*****************************************
        'основной расчёт
        'находим энтальпию по приложению №2
        'N = 123
        'ReDim_XX(N)
        'ReDim_YY(N)
        'ReDim_M(N)
        'For I = 1 To N
        '    XX(I) = Табс(I)
        '    YY(I) = Ig(I)
        '    M(I) = Kof1(I)
        'Next I
        'B = Аппроксимация(N, XX, YY, Kof1, (T3 - 3) + conКельвин)
        'B = Аппроксимация(N, XX, YY, Kof1, T3 + conКельвин)
        B = Spline3.Аппроксимация(UBound(Табс), Табс, Ig, Kof1, (T3 - 3.0))


        'находим ожидаемую Трасч первого приближения по приложению №3
        'N = 33
        'ReDim_XX(N)
        'ReDim_YY(N)
        'ReDim_M(N)
        'For I = 1 To N
        '    XX(I) = Лямда(I)
        '    YY(I) = Разность(I)
        'Next I
        'Tgras = Аппроксимация(N, XX, YY, Kof2, ЛямдаS) + (T3 - 3) + conКельвин
        'Tgras = Аппроксимация(N, XX, YY, Kof2, АльфаСум) + T3 + conКельвин
        Tgras = Spline3.Аппроксимация(UBound(Лямда), Лямда, Разность, Kof2, АльфаСум) + (T3 - 3.0)


        'приведение расхода топлива в секунду
        'здесь не надо
        'Gtks = Gtks / 3600
        'относительный расход топлива на единицу расхода воэдуха
        C = Gtks / Gbks
        'точности w начальное присвоение
        W = 1.0#
        Do While W > 0.5
            'N = 171
            'ReDim_XX(N)
            'ReDim_YY(N)
            'ReDim_M(N)
            'For I = 1 To N
            '    XX(I) = Табс2(I)
            '    YY(I) = Az(I)
            'Next I
            'a = Аппроксимация(N, XX, YY, Kof3, Tgras)
            a = Spline3.Аппроксимация(UBound(Табс2), Табс2, Az, Kof3, Tgras)

            a = B + C * a
            'N = 123
            'ReDim_XX(N)
            'ReDim_YY(N)
            'ReDim_M(N)
            'For I = 1 To N
            '    XX(I) = Ig(I)
            '    YY(I) = Табс(I)
            'Next I
            'a = Аппроксимация(N, XX, YY, Kof4, a)
            a = Spline3.Аппроксимация(UBound(Ig), Ig, Табс, Kof4, a)

            W = Abs(Tgras - a)
            Tgras = a
            Ik += 1
            'защита от зацикливания при отладки
            If Ik > 100 Then
                Tgras = 0
                Exit Do
            End If
        Loop
        'приведение к цельсию
        Return Tgras - conКельвин
    End Function

    Public Function КоэфУчитывающийПлотность(ByVal Температура As Double) As Double
        Return Spline3.Spline3Interpolate(UBound(TblКоэффициентыПлотностиТоплива, 2) + 1, TblКоэффициентыПлотностиТоплива, Температура)
    End Function

End Class
